/*
1.Создать класс User(полное имя, возраст, пол, почта, страна)
2.Создать класс Employee(всё то, что у Юзера, оклад, должность, отдел)
3.Создать ArrayList, в котором юзеры и сотрудники
4.Получить средний возраст
5.Получить средний возраст среди несовершеннолетних
6.Получить пользователей, у которых почта "@gmail.com" или "@mail.ru"
7.Получить почты всех совершеннолетних женщин, не старше 30,
проживающих в Украине, которые являются Emloyee
 */

package prog01;

public class Main01 {

    public static void main(String[] args) {
        Prog prog = new Prog();
        prog.go();
    }
}
